{"config": {"name": "sequential_1", "layers": [{"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "filters": 32, "dtype": "float32", "strides": [1, 1], "batch_input_shape": [null, 160, 160, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null, "activation": "relu", "kernel_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "name": "conv2d_1", "use_bias": true, "kernel_size": [3, 3], "trainable": true, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "padding": "valid", "strides": [2, 2], "name": "max_pooling2d_1", "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null, "activation": "relu", "kernel_constraint": null, "data_format": "channels_last", "padding": "same", "name": "conv2d_2", "use_bias": true, "kernel_regularizer": null, "trainable": true, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "padding": "valid", "strides": [2, 2], "name": "max_pooling2d_2", "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null, "activation": "relu", "kernel_constraint": null, "data_format": "channels_last", "padding": "same", "name": "conv2d_3", "use_bias": true, "kernel_regularizer": null, "trainable": true, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "padding": "valid", "strides": [2, 2], "name": "max_pooling2d_3", "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "relu", "units": 128, "use_bias": true, "trainable": true, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dense_2", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "softmax", "units": 3, "use_bias": true, "trainable": true, "bias_constraint": null}, "class_name": "Dense"}]}, "backend": "tensorflow", "keras_version": "2.2.4", "class_name": "Sequential"}